<?php $current = 'textclip';$mainmenu = '1';?>
<!DOCTYPE html>
<html>
 	<head> 
  		<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" /> 
  		<meta name="renderer" content="webkit" /> 
  		<meta charset="utf-8" /> 
  		<title>文字截取</title> 
 		 <?php include "common/css.php" ;?> 
 	</head>
<body> 
<?php include "common/body_top.php" ;?>
				<!-- 正文开始 ----------S------------>
				<div class="main_hd main_hd_bd">
					<h2>文字截取</h2>    
				</div>
				<div class="alert">
					文字截取均默认保留一行，类名为textclip；增加保留行数，就增加类名line2，line3
				</div>
				<div class="main_bd">
					<div class="textclip" title="这段文字有100多个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					保留一行，这段文字有100个字，保留一行">这段文字有100多个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，保留一行，这段文字有100个字，
					保留一行，这段文字有100个字，保留一行，</div>
					<div class="alert alert-info m-t-md">保留二行</div>
					<div class="textclip line2 p-b" title="这段文字有100多个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					保留二行，这段文字有100个字，保留二行">这段文字有100多个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，保留二行，这段文字有100个字，
					保留二行，这段文字有100个字，保留二行，</div>
					<div class="alert alert-info m-t-md">保留三行</div>
					<div class="textclip line3" title="这段文字有100多个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					保留三行，这段文字有100个字，保留三行">这段文字有100多个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，保留三行，这段文字有100个字，
					保留三行，这段文字有100个字，保留三行，</div>
				
				</div>
				<!-- 正文结束 ----------E------------>
<?php include "common/body_bottom.php" ;?>
   <!-- 中间写自己的js或者引入的js -->

   
   <!-- footer.php一定要放在页面最下端 -->
   <?php include "common/footer.php" ;?>
</body>
</html>